In [3]:
import numpy as np
import pandas as pd

df = pd.DataFrame(np.arange(9).reshape(3, 3), columns=["a", "b", "c"])

In [2]:
df

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [3]:
#drop values. if want to drop column use axis=1
df.drop(0, axis=0)

   a  b  c
1  3  4  5
2  6  7  8

In [4]:
#drop first and third rows
df.drop([0, 2], axis=0)

   a  b  c
1  3  4  5

In [5]:
df.drop(["b", "c"], axis=1)

   a
0  0
1  3
2  6

In [6]:
#arithmetic operations ie ading columns
df["a"] + df["b"]

0     1
1     7
2    13
dtype: int32

In [7]:
#similarly using pandas
df["a"].add(df["b"])

0     1
1     7
2    13
dtype: int32

In [8]:
#adding row 1 & 2 to the df results in error on third row as shape of the DFs do not match
df.add(df.loc[0:1, :])

     a    b     c
0  0.0  2.0   4.0
1  6.0  8.0  10.0
2  NaN  NaN   NaN

In [9]:
#include a value for when this happens
df.add(df.loc[0:1, :], fill_value=0)

     a    b     c
0  0.0  2.0   4.0
1  6.0  8.0  10.0
2  6.0  7.0   8.0

this adds a third row of value 0 to the dataframe

In [4]:
#concatenate
df1 = pd.DataFrame([["Mark", 50], ["Kate", 46]], columns=["name", "age"])
df2 = pd.DataFrame([["Jon", 3], ["David", 4]], columns=["name", "age"])

In [5]:
pd.concat([df1, df2])

    name  age
0   Mark   50
1   Kate   46
0    Jon    3
1  David    4

combining two DFs did not change the index

In [6]:
df3 = pd.DataFrame(["writer", "journalist"], columns=["occupation"])

In [7]:
pd.concat([df1, df3], axis=1)

   name  age  occupation
0  Mark   50      writer
1  Kate   46  journalist